MikroElektronika/core_packages/PIC/XC8/def/PIC18F4480/mcu.h
// Register: RXF15SIDL
#define RXF15SIDL RXF15SIDL
extern volatile unsigned char           RXF15SIDL           __at(0xD91);
#ifndef _LIB_BUILD
asm("RXF15SIDL equ 0D91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF15EID16             :1;
        unsigned RXF15EID17             :1;
        unsigned                        :1;
        unsigned RXF15EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF15SID0              :1;
        unsigned RXF15SID1              :1;
        unsigned RXF15SID2              :1;
    };
} RXF15SIDLbits_t;
extern volatile RXF15SIDLbits_t RXF15SIDLbits __at(0xD91);
// bitfield macros
#define _RXF15SIDL_EID16_POSN                               0x0
#define _RXF15SIDL_EID16_POSITION                           0x0
#define _RXF15SIDL_EID16_SIZE                               0x1
#define _RXF15SIDL_EID16_LENGTH                             0x1
#define _RXF15SIDL_EID16_MASK                               0x1
#define _RXF15SIDL_EID17_POSN                               0x1
#define _RXF15SIDL_EID17_POSITION                           0x1
#define _RXF15SIDL_EID17_SIZE                               0x1
#define _RXF15SIDL_EID17_LENGTH                             0x1
#define _RXF15SIDL_EID17_MASK                               0x2
#define _RXF15SIDL_EXIDEN_POSN                              0x3
#define _RXF15SIDL_EXIDEN_POSITION                          0x3
#define _RXF15SIDL_EXIDEN_SIZE                              0x1
#define _RXF15SIDL_EXIDEN_LENGTH                            0x1
#define _RXF15SIDL_EXIDEN_MASK                              0x8
#define _RXF15SIDL_SID0_POSN                                0x5
#define _RXF15SIDL_SID0_POSITION                            0x5
#define _RXF15SIDL_SID0_SIZE                                0x1
#define _RXF15SIDL_SID0_LENGTH                              0x1
#define _RXF15SIDL_SID0_MASK                                0x20
#define _RXF15SIDL_SID1_POSN                                0x6
#define _RXF15SIDL_SID1_POSITION                            0x6
#define _RXF15SIDL_SID1_SIZE                                0x1
#define _RXF15SIDL_SID1_LENGTH                              0x1
#define _RXF15SIDL_SID1_MASK                                0x40
#define _RXF15SIDL_SID2_POSN                                0x7
#define _RXF15SIDL_SID2_POSITION                            0x7
#define _RXF15SIDL_SID2_SIZE                                0x1
#define _RXF15SIDL_SID2_LENGTH                              0x1
#define _RXF15SIDL_SID2_MASK                                0x80
#define _RXF15SIDL_EXIDE_POSN                               0x3
#define _RXF15SIDL_EXIDE_POSITION                           0x3
#define _RXF15SIDL_EXIDE_SIZE                               0x1
#define _RXF15SIDL_EXIDE_LENGTH                             0x1
#define _RXF15SIDL_EXIDE_MASK                               0x8
#define _RXF15SIDL_RXF15EID16_POSN                          0x0
#define _RXF15SIDL_RXF15EID16_POSITION                      0x0
#define _RXF15SIDL_RXF15EID16_SIZE                          0x1
#define _RXF15SIDL_RXF15EID16_LENGTH                        0x1
#define _RXF15SIDL_RXF15EID16_MASK                          0x1
#define _RXF15SIDL_RXF15EID17_POSN                          0x1
#define _RXF15SIDL_RXF15EID17_POSITION                      0x1
#define _RXF15SIDL_RXF15EID17_SIZE                          0x1
#define _RXF15SIDL_RXF15EID17_LENGTH                        0x1
#define _RXF15SIDL_RXF15EID17_MASK                          0x2
#define _RXF15SIDL_RXF15EXIDEN_POSN                         0x3
#define _RXF15SIDL_RXF15EXIDEN_POSITION                     0x3
#define _RXF15SIDL_RXF15EXIDEN_SIZE                         0x1
#define _RXF15SIDL_RXF15EXIDEN_LENGTH                       0x1
#define _RXF15SIDL_RXF15EXIDEN_MASK                         0x8
#define _RXF15SIDL_RXF15SID0_POSN                           0x5
#define _RXF15SIDL_RXF15SID0_POSITION                       0x5
#define _RXF15SIDL_RXF15SID0_SIZE                           0x1
#define _RXF15SIDL_RXF15SID0_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID0_MASK                           0x20
#define _RXF15SIDL_RXF15SID1_POSN                           0x6
#define _RXF15SIDL_RXF15SID1_POSITION                       0x6
#define _RXF15SIDL_RXF15SID1_SIZE                           0x1
#define _RXF15SIDL_RXF15SID1_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID1_MASK                           0x40
#define _RXF15SIDL_RXF15SID2_POSN                           0x7
#define _RXF15SIDL_RXF15SID2_POSITION                       0x7
#define _RXF15SIDL_RXF15SID2_SIZE                           0x1
#define _RXF15SIDL_RXF15SID2_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID2_MASK                           0x80

// Register: RXF15EIDH
#define RXF15EIDH RXF15EIDH
extern volatile unsigned char           RXF15EIDH           __at(0xD92);
#ifndef _LIB_BUILD
asm("RXF15EIDH equ 0D92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF15EID8              :1;
        unsigned RXF15EID9              :1;
        unsigned RXF15EID10             :1;
        unsigned RXF15EID11             :1;
        unsigned RXF15EID12             :1;
        unsigned RXF15EID13             :1;
        unsigned RXF15EID14             :1;
        unsigned RXF15EID15             :1;
    };
} RXF15EIDHbits_t;
extern volatile RXF15EIDHbits_t RXF15EIDHbits __at(0xD92);
// bitfield macros
#define _RXF15EIDH_EID8_POSN                                0x0
#define _RXF15EIDH_EID8_POSITION                            0x0
#define _RXF15EIDH_EID8_SIZE                                0x1
#define _RXF15EIDH_EID8_LENGTH                              0x1
#define _RXF15EIDH_EID8_MASK                                0x1
#define _RXF15EIDH_EID9_POSN                                0x1
#define _RXF15EIDH_EID9_POSITION                            0x1
#define _RXF15EIDH_EID9_SIZE                                0x1
#define _RXF15EIDH_EID9_LENGTH                              0x1
#define _RXF15EIDH_EID9_MASK                                0x2
#define _RXF15EIDH_EID10_POSN                               0x2
#define _RXF15EIDH_EID10_POSITION                           0x2
#define _RXF15EIDH_EID10_SIZE                               0x1
#define _RXF15EIDH_EID10_LENGTH                             0x1
#define _RXF15EIDH_EID10_MASK                               0x4
#define _RXF15EIDH_EID11_POSN                               0x3
#define _RXF15EIDH_EID11_POSITION                           0x3
#define _RXF15EIDH_EID11_SIZE                               0x1
#define _RXF15EIDH_EID11_LENGTH                             0x1
#define _RXF15EIDH_EID11_MASK                               0x8
#define _RXF15EIDH_EID12_POSN                               0x4
#define _RXF15EIDH_EID12_POSITION                           0x4
#define _RXF15EIDH_EID12_SIZE                               0x1
#define _RXF15EIDH_EID12_LENGTH                             0x1
#define _RXF15EIDH_EID12_MASK                               0x10
#define _RXF15EIDH_EID13_POSN                               0x5
#define _RXF15EIDH_EID13_POSITION                           0x5
#define _RXF15EIDH_EID13_SIZE                               0x1
#define _RXF15EIDH_EID13_LENGTH                             0x1
#define _RXF15EIDH_EID13_MASK                               0x20
#define _RXF15EIDH_EID14_POSN                               0x6
#define _RXF15EIDH_EID14_POSITION                           0x6
#define _RXF15EIDH_EID14_SIZE                               0x1
#define _RXF15EIDH_EID14_LENGTH                             0x1
#define _RXF15EIDH_EID14_MASK                               0x40
#define _RXF15EIDH_EID15_POSN                               0x7
#define _RXF15EIDH_EID15_POSITION                           0x7
#define _RXF15EIDH_EID15_SIZE                               0x1
#define _RXF15EIDH_EID15_LENGTH                             0x1
#define _RXF15EIDH_EID15_MASK                               0x80
#define _RXF15EIDH_RXF15EID8_POSN                           0x0
#define _RXF15EIDH_RXF15EID8_POSITION                       0x0
#define _RXF15EIDH_RXF15EID8_SIZE                           0x1
#define _RXF15EIDH_RXF15EID8_LENGTH                         0x1
#define _RXF15EIDH_RXF15EID8_MASK                           0x1
#define _RXF15EIDH_RXF15EID9_POSN                           0x1
#define _RXF15EIDH_RXF15EID9_POSITION                       0x1
#define _RXF15EIDH_RXF15EID9_SIZE                           0x1
#define _RXF15EIDH_RXF15EID9_LENGTH                         0x1
#define _RXF15EIDH_RXF15EID9_MASK                           0x2
#define _RXF15EIDH_RXF15EID10_POSN                          0x2
#define _RXF15EIDH_RXF15EID10_POSITION                      0x2
#define _RXF15EIDH_RXF15EID10_SIZE                          0x1
#define _RXF15EIDH_RXF15EID10_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID10_MASK                          0x4
#define _RXF15EIDH_RXF15EID11_POSN                          0x3
#define _RXF15EIDH_RXF15EID11_POSITION                      0x3
#define _RXF15EIDH_RXF15EID11_SIZE                          0x1
#define _RXF15EIDH_RXF15EID11_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID11_MASK                          0x8
#define _RXF15EIDH_RXF15EID12_POSN                          0x4
#define _RXF15EIDH_RXF15EID12_POSITION                      0x4
#define _RXF15EIDH_RXF15EID12_SIZE                          0x1
#define _RXF15EIDH_RXF15EID12_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID12_MASK                          0x10
#define _RXF15EIDH_RXF15EID13_POSN                          0x5
#define _RXF15EIDH_RXF15EID13_POSITION                      0x5
#define _RXF15EIDH_RXF15EID13_SIZE                          0x1
#define _RXF15EIDH_RXF15EID13_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID13_MASK                          0x20
#define _RXF15EIDH_RXF15EID14_POSN                          0x6
#define _RXF15EIDH_RXF15EID14_POSITION                      0x6
#define _RXF15EIDH_RXF15EID14_SIZE                          0x1
#define _RXF15EIDH_RXF15EID14_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID14_MASK                          0x40
#define _RXF15EIDH_RXF15EID15_POSN                          0x7
#define _RXF15EIDH_RXF15EID15_POSITION                      0x7
#define _RXF15EIDH_RXF15EID15_SIZE                          0x1
#define _RXF15EIDH_RXF15EID15_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID15_MASK                          0x80

// Register: RXF15EIDL
#define RXF15EIDL RXF15EIDL
extern volatile unsigned char           RXF15EIDL           __at(0xD93);
#ifndef _LIB_BUILD
asm("RXF15EIDL equ 0D93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF15EID0              :1;
        unsigned RXF15EID1              :1;
        unsigned RXF15EID2              :1;
        unsigned RXF15EID3              :1;
        unsigned RXF15EID4              :1;
        unsigned RXF15EID5              :1;
        unsigned RXF15EID6              :1;
        unsigned RXF15EID7              :1;
    };
} RXF15EIDLbits_t;
extern volatile RXF15EIDLbits_t RXF15EIDLbits __at(0xD93);
// bitfield macros
#define _RXF15EIDL_EID0_POSN                                0x0
#define _RXF15EIDL_EID0_POSITION                            0x0
#define _RXF15EIDL_EID0_SIZE                                0x1
#define _RXF15EIDL_EID0_LENGTH                              0x1
#define _RXF15EIDL_EID0_MASK                                0x1
#define _RXF15EIDL_EID1_POSN                                0x1
#define _RXF15EIDL_EID1_POSITION                            0x1
#define _RXF15EIDL_EID1_SIZE                                0x1
#define _RXF15EIDL_EID1_LENGTH                              0x1
#define _RXF15EIDL_EID1_MASK                                0x2
#define _RXF15EIDL_EID2_POSN                                0x2
#define _RXF15EIDL_EID2_POSITION                            0x2
#define _RXF15EIDL_EID2_SIZE                                0x1
#define _RXF15EIDL_EID2_LENGTH                              0x1
#define _RXF15EIDL_EID2_MASK                                0x4
#define _RXF15EIDL_EID3_POSN                                0x3
#define _RXF15EIDL_EID3_POSITION                            0x3
#define _RXF15EIDL_EID3_SIZE                                0x1
#define _RXF15EIDL_EID3_LENGTH                              0x1
#define _RXF15EIDL_EID3_MASK                                0x8
#define _RXF15EIDL_EID4_POSN                                0x4
#define _RXF15EIDL_EID4_POSITION                            0x4
#define _RXF15EIDL_EID4_SIZE                                0x1
#define _RXF15EIDL_EID4_LENGTH                              0x1
#define _RXF15EIDL_EID4_MASK                                0x10
#define _RXF15EIDL_EID5_POSN                                0x5
#define _RXF15EIDL_EID5_POSITION                            0x5
#define _RXF15EIDL_EID5_SIZE                                0x1
#define _RXF15EIDL_EID5_LENGTH                              0x1
#define _RXF15EIDL_EID5_MASK                                0x20
#define _RXF15EIDL_EID6_POSN                                0x6
#define _RXF15EIDL_EID6_POSITION                            0x6
#define _RXF15EIDL_EID6_SIZE                                0x1
#define _RXF15EIDL_EID6_LENGTH                              0x1
#define _RXF15EIDL_EID6_MASK                                0x40
#define _RXF15EIDL_EID7_POSN                                0x7
#define _RXF15EIDL_EID7_POSITION                            0x7
#define _RXF15EIDL_EID7_SIZE                                0x1
#define _RXF15EIDL_EID7_LENGTH                              0x1
#define _RXF15EIDL_EID7_MASK                                0x80
#define _RXF15EIDL_RXF15EID0_POSN                           0x0
#define _RXF15EIDL_RXF15EID0_POSITION                       0x0
#define _RXF15EIDL_RXF15EID0_SIZE                           0x1
#define _RXF15EIDL_RXF15EID0_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID0_MASK                           0x1
#define _RXF15EIDL_RXF15EID1_POSN                           0x1
#define _RXF15EIDL_RXF15EID1_POSITION                       0x1
#define _RXF15EIDL_RXF15EID1_SIZE                           0x1
#define _RXF15EIDL_RXF15EID1_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID1_MASK                           0x2
#define _RXF15EIDL_RXF15EID2_POSN                           0x2
#define _RXF15EIDL_RXF15EID2_POSITION                       0x2
#define _RXF15EIDL_RXF15EID2_SIZE                           0x1
#define _RXF15EIDL_RXF15EID2_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID2_MASK                           0x4
#define _RXF15EIDL_RXF15EID3_POSN                           0x3
#define _RXF15EIDL_RXF15EID3_POSITION                       0x3
#define _RXF15EIDL_RXF15EID3_SIZE                           0x1
#define _RXF15EIDL_RXF15EID3_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID3_MASK                           0x8
#define _RXF15EIDL_RXF15EID4_POSN                           0x4
#define _RXF15EIDL_RXF15EID4_POSITION                       0x4
#define _RXF15EIDL_RXF15EID4_SIZE                           0x1
#define _RXF15EIDL_RXF15EID4_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID4_MASK                           0x10
#define _RXF15EIDL_RXF15EID5_POSN                           0x5
#define _RXF15EIDL_RXF15EID5_POSITION                       0x5
#define _RXF15EIDL_RXF15EID5_SIZE                           0x1
#define _RXF15EIDL_RXF15EID5_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID5_MASK                           0x20
#define _RXF15EIDL_RXF15EID6_POSN                           0x6
#define _RXF15EIDL_RXF15EID6_POSITION                       0x6
#define _RXF15EIDL_RXF15EID6_SIZE                           0x1
#define _RXF15EIDL_RXF15EID6_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID6_MASK                           0x40
#define _RXF15EIDL_RXF15EID7_POSN                           0x7
#define _RXF15EIDL_RXF15EID7_POSITION                       0x7
#define _RXF15EIDL_RXF15EID7_SIZE                           0x1
#define _RXF15EIDL_RXF15EID7_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID7_MASK                           0x80

// Register: RXFCON0
#define RXFCON0 RXFCON0
extern volatile unsigned char           RXFCON0             __at(0xDD4);
#ifndef _LIB_BUILD
asm("RXFCON0 equ 0DD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXF0EN                 :1;
        unsigned RXF1EN                 :1;
        unsigned RXF2EN                 :1;
        unsigned RXF3EN                 :1;
        unsigned RXF4EN                 :1;
        unsigned RXF5EN                 :1;
        unsigned RXF6EN                 :1;
        unsigned RXF7EN                 :1;
    };
} RXFCON0bits_t;
extern volatile RXFCON0bits_t RXFCON0bits __at(0xDD4);
// bitfield macros
#define _RXFCON0_RXF0EN_POSN                                0x0
#define _RXFCON0_RXF0EN_POSITION                            0x0
#define _RXFCON0_RXF0EN_SIZE                                0x1
#define _RXFCON0_RXF0EN_LENGTH                              0x1
#define _RXFCON0_RXF0EN_MASK                                0x1
#define _RXFCON0_RXF1EN_POSN                                0x1
#define _RXFCON0_RXF1EN_POSITION                            0x1
#define _RXFCON0_RXF1EN_SIZE                                0x1
#define _RXFCON0_RXF1EN_LENGTH                              0x1
#define _RXFCON0_RXF1EN_MASK                                0x2
#define _RXFCON0_RXF2EN_POSN                                0x2
#define _RXFCON0_RXF2EN_POSITION                            0x2
#define _RXFCON0_RXF2EN_SIZE                                0x1
#define _RXFCON0_RXF2EN_LENGTH                              0x1
#define _RXFCON0_RXF2EN_MASK                                0x4
#define _RXFCON0_RXF3EN_POSN                                0x3
#define _RXFCON0_RXF3EN_POSITION                            0x3
#define _RXFCON0_RXF3EN_SIZE                                0x1
#define _RXFCON0_RXF3EN_LENGTH                              0x1
#define _RXFCON0_RXF3EN_MASK                                0x8
#define _RXFCON0_RXF4EN_POSN                                0x4
#define _RXFCON0_RXF4EN_POSITION                            0x4
#define _RXFCON0_RXF4EN_SIZE                                0x1
#define _RXFCON0_RXF4EN_LENGTH                              0x1
#define _RXFCON0_RXF4EN_MASK                                0x10
#define _RXFCON0_RXF5EN_POSN                                0x5
#define _RXFCON0_RXF5EN_POSITION                            0x5
#define _RXFCON0_RXF5EN_SIZE                                0x1
#define _RXFCON0_RXF5EN_LENGTH                              0x1
#define _RXFCON0_RXF5EN_MASK                                0x20
#define _RXFCON0_RXF6EN_POSN                                0x6
#define _RXFCON0_RXF6EN_POSITION                            0x6
#define _RXFCON0_RXF6EN_SIZE                                0x1
#define _RXFCON0_RXF6EN_LENGTH                              0x1
#define _RXFCON0_RXF6EN_MASK                                0x40
#define _RXFCON0_RXF7EN_POSN                                0x7
#define _RXFCON0_RXF7EN_POSITION                            0x7
#define _RXFCON0_RXF7EN_SIZE                                0x1
#define _RXFCON0_RXF7EN_LENGTH                              0x1
#define _RXFCON0_RXF7EN_MASK                                0x80

